Котельников_АБ_70153995/src/Documents/ПроведениеСобеседования/ПроведениеСобеседования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеСобеседования</name>
  <registerRecords>InformationRegister.СтатусыКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоКандидатовПоЭтапам</registerRecords>
  <attributes>
    <name>ТипСобеседования</name>
    <type>
      <types>EnumRef.ТипыСобеседований</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСобеседования</name>
    <type>
      <types>EnumRef.СтатусыСобеседований</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобеседования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>КандидатУведомлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСобеседования</name>
    <type>
      <types>EnumRef.РезультатыСобеседования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеЛицаЗаСобеседование</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Enums/РезультатыСобеседования/РезультатыСобеседования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыСобеседования</name>
  <enumValues>
    <name>СоответствуетТребованиям</name>
  </enumValues>
  <enumValues>
    <name>НеСоответствуетТребованиям</name>
  </enumValues>
  <enumValues>
    <name>НеЯвилсяНаСобеседование</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/Вакансия/Вакансия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вакансия</name>
  <basedOn>Document.СогласованиеЗаявки</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияВакансий</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СогласованиеЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВакансияРазмещенаНаСайте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаВакансию</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПоискКандидатов</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВакансии</name>
    <type>
      <types>EnumRef.СтатусыВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВакансии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпытРаботы</name>
    <type>
      <types>EnumRef.ОпытРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматРаботы</name>
    <type>
      <types>EnumRef.ФорматыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоВычетаНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФорматированногоТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКВакансии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетПоиска</name>
    <type>
      <types>EnumRef.ПриоритетыПоиска</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеНавыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.КлючевыеНавыки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниПрофессиональныхНавыков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛичныеКачества</name>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.ЛичныеКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗнанияЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.Языки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниЗнанийЯзыков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/ПроведениеСобеседования/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ПроведениеСобеседования.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроведениеСобеседования.ДатаСобеседования КАК ДатаСобеседования,
	|	ПроведениеСобеседования.Кандидат КАК Кандидат,
	|	ПроведениеСобеседования.РезультатСобеседования КАК РезультатСобеседования,
	|	ПроведениеСобеседования.Вакансия.НаименованиеВакансии КАК НаименованиеВакансии,
	|	ПроведениеСобеседования.Вакансия.ДокументОснование.Номер КАК НомерЗаявки,
	|	ПроведениеСобеседования.Кандидат.Возраст КАК Возраст,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПроведениеСобеседования.Вакансия.ОтветственныйЗаПоискКандидатов) КАК ОтветственныйЗаСобеседование,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПроведениеСобеседования.Вакансия.ОтветственныйЗаПоискКандидатов.Должность) КАК Должность,
	|	ПроведениеСобеседования.Вакансия.Образование КАК Образование,
	|	ПроведениеСобеседования.Вакансия.ОпытРаботы КАК ОпытРаботы,
	|	ПроведениеСобеседования.ОписаниеРезультата КАК ОписаниеРезультата
	|ИЗ
	|	Документ.ПроведениеСобеседования КАК ПроведениеСобеседования
	|ГДЕ
	|	ПроведениеСобеседования.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		
		ДанныеДляЗаполнения = ПолучитьДанныеДляЗаполнения(Ссылка[0].Вакансия);
		КлючевыеНавыки = ДанныеДляЗаполнения[0];
		СтрокаНавыков = НРег(СтрСоединить(КлючевыеНавыки, ", "));
		Шапка.Параметры.Навыки = СтрокаНавыков;	
		
		ЗнанияЯзыков = ДанныеДляЗаполнения[2];
		СтрокаЗнанийЯзыков = "";
		Для Каждого ЗнаниеЯзыка Из ЗнанияЯзыков Цикл
			СтрокаЗнанийЯзыков = СтрокаЗнанийЯзыков + ЗнаниеЯзыка.Язык + " (" + ЗнаниеЯзыка.УровеньВладения + ")" + ", "; 
		КонецЦикла;	
		СтрокаЗнанийЯзыков = Лев(СтрокаЗнанийЯзыков, СтрДлина(СтрокаЗнанийЯзыков) - 2);
		Шапка.Параметры.ЗнанияИностранного = СтрокаЗнанийЯзыков;
		
		ЛичныеКачества = ДанныеДляЗаполнения[1];
		СтрокаКачеств = НРег(СтрСоединить(ЛичныеКачества, ", "));
		Шапка.Параметры.Качества = СтрокаКачеств;
		
		Если Выборка.РезультатСобеседования = Перечисления.РезультатыСобеседования.Другое Тогда
			Шапка.Параметры.РезультатСобеседования = Выборка.ОписаниеРезультата;
		КонецЕсли;
		
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДанныеДляЗаполнения(Вакансия)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВакансияКлючевыеНавыки.Навык) КАК Навык
		|ИЗ
		|	Документ.Вакансия.КлючевыеНавыки КАК ВакансияКлючевыеНавыки
		|ГДЕ
		|	ВакансияКлючевыеНавыки.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВакансияЛичныеКачества.Качество) КАК Качество
		|ИЗ
		|	Документ.Вакансия.ЛичныеКачества КАК ВакансияЛичныеКачества
		|ГДЕ
		|	ВакансияЛичныеКачества.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВакансияЗнанияЯзыков.Язык) КАК Язык,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВакансияЗнанияЯзыков.УровеньВладения) КАК УровеньВладения
		|ИЗ
		|	Документ.Вакансия.ЗнанияЯзыков КАК ВакансияЗнанияЯзыков
		|ГДЕ
		|	ВакансияЗнанияЯзыков.Ссылка = &Ссылка
		|	И ВакансияЗнанияЯзыков.Язык <> ЗНАЧЕНИЕ(Справочник.Языки.РусскийЯзык)";
	
	Запрос.УстановитьПараметр("Ссылка", Вакансия);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляЗаполнения = Новый Массив;
	
	КлючевыеНавыки = РезультатЗапроса[0].Выбрать();
	СписокНавыков = Новый Массив;
	Пока КлючевыеНавыки.Следующий() Цикл
		СписокНавыков.Добавить(КлючевыеНавыки.Навык);	
	КонецЦикла;
	ДанныеДляЗаполнения.Добавить(СписокНавыков);
	
	ЛичныеКачества = РезультатЗапроса[1].Выбрать();
	СписокКачеств = Новый Массив;
	Пока ЛичныеКачества.Следующий() Цикл
		СписокКачеств.Добавить(ЛичныеКачества.Качество);	
	КонецЦикла;
	ДанныеДляЗаполнения.Добавить(СписокКачеств);
	
	ЗнанияЯзыков = РезультатЗапроса[2].Выбрать();
	СписокЯзыков = Новый Массив;
	Пока ЗнанияЯзыков.Следующий() Цикл
		ДанныеЯзыка = Новый Структура("Язык, УровеньВладения", ЗнанияЯзыков.Язык, ЗнанияЯзыков.УровеньВладения);
		СписокЯзыков.Добавить(ДанныеЯзыка);	
	КонецЦикла;

	ДанныеДляЗаполнения.Добавить(СписокЯзыков);
	
	Возврат ДанныеДляЗаполнения; 

КонецФункции
